{"title":"Pull Requests: you better use them.","content":"Pull requests are a feature that many of repository hosting service provides such GitHub and Bitbucket . It is a better way of submitting contributions to a project using a distributed version control system such as Git or Mercurial and easier for developers to collaborate. It is important to highlight that PRs are a workflow feature , and not a feature of the version control system itself. And pull requesting occurs when a developer asks for changes committed to an external repository, often the local repository and a different branch from the branch you want to pull request to, to be considered for inclusion in a project’s main repository. PRs are basically a mechanism for a developer to tell team members that he/she has completed a feature and it’s ready to be included often on other branch by merging. Thus, all team members are notified of a new PR and can inspect it and merge it, including you ~ but it's not a good practice ~ . Generally, the hosting services provide a complete forum showing all info about the changes, who did it, why did it... PR flow is basically: You made changes on your branch and pull it to your respective branch on remote repository Then, on its hosting service there is a link to create a pull request where you choose the repo which is the source of the modifications and the destination. The team members, not you , analyse your modifications, discuss them, alter them, aprove them. When all is ok, the project maintainer merges it. PR is closed. Below is an real example of one of my repo in GitHub: Facebook Link Preview . Some developers has forked my repo and pull-requested to it. List of pull requests Pull request flow Pull request commit Here are two links to know about them: GitHub pull requests Bitbucket pull requests","path":"pull-requests-you-better-use-them","image":"http://i.imgur.com/s6WXbc9.png","released":true,"date":"2015-02-01T10:47:35.000Z","tags":["git","mercurial","scm"]}