{"title":"Bitcoin","content":"Trade on Internet and its continuous usage increased the demand for quick and easy ways of payment, driving the emergence of online payment systems over the past years. Although there are several of these systems called \"virtual wallets\", all their properties are based on fiat currencies like the real and the gold, that is, physical coins. Thus, almost all transactions made are entrusted to financial institutions, called \"trusted third parties\" for the validation of centralised electronic payments. Bitcoin was designed to be an exception to the these conventional ways. Presented to the world in 2009 by Satoshi Nakamoto, Bitcoin is an independent fully electronic monetary system that has in its own structure based encryption, hashes as identifying unit, irreversible transactions, and the ability to verify and validate their transactions using protocols on a global peer-to-peer network of participants, thus, decentralised and distributed, earning the title of the first cryptocurrency. Despite not being a regulated currency, the acronym BTC is adopted as an international currency code. It is not bound to any governments, fiat currencies or other commodities. It relies on cryptography and protocols to allow transactions to be performed among two parties without going through financial institutions or validator companies of digital signatures named trusted third party. Thus, Bitcoin has the peculiarity of keeping entities' identity anonymously, while its flows is explicit and globally visible. Bitcoins transactions are broadcast to the network and collected into blocks. A transaction references previous transaction outputs, containing addresses which are SHA-256 hashes, as new transaction inputs and dedicates all input Bitcoin values to new outputs. Transactions are not encrypted as said before, so it is possible to browse and view every transaction ever collected into a block. Like the other kinds of money, the number of Bitcoins is finite. Unlike them, one Bitcoin is infinitely divided. So you can divide one fraction of Bitcoin into other infinite fractions. This is why some refer to \"infinite\" divisibility, because the network can select the level that is needed as time goes on. The current level selected in the code (by Satoshi) is 8 decimal places (1 satoshi = 0.00000001 BTC). New bitcoins are generated by the network through the process of \"mining\". Bitcoin miners use a special software to solve math problems in a certain amount of Bitcoins in exchange. This is a way to issue the currency and also it incentives other people to mining. The miners solve these math problems and also verifies the transactions that are being made along the network. As the math problems grow harder, mining pools were created to make a faster mining. Mining pools work like a computer network and each pool miner is rewarded according to the amount of work that he/she provided. Just like a continuous raffle draw, mining nodes on the network are awarded bitcoins each time they find the solution to a certain mathematical problem (and thereby create a new block). Creating a block is a proof of work with a difficulty that varies with the overall strength of the network. The reward for solving a block is automatically adjusted so that, ideally, every four years of operation of the Bitcoin network, half the amount of bitcoins created in the prior 4 years are created. The last block that will generate coins will be block #6,929,999 which should be generated at or near the year 2140. The total number of coins in circulation will then remain static at 20,999,999.9769 BTC. It may seem easy but surprisingly, it's still not easy to buy bitcoins with your credit card or PayPal. This is because such transactions can easily be tracked. First of all, you need to get yourself a Bitcoin wallet. A lot of apps or websites can do it for you because they use Bitcoin API to generate them. Second, there are many websites that work as markets, just like stock exchanges and home brokers, buying and selling Bitcoins. Most of them allow you to convert real money into Bitcoin. Markets Bitcoin Ticker : Tick by tick, real time updates. All data is indicative. Coinbase : Your bitcoin wallet Mercado Bitcoin : Largets market in Latin America Complementary readings Bitcoin Bitcoin Simplified Price Slump Tests Bitcoin’s Self-Correcting Economics Bitcoin: Our Best Tool for Privacy and Identity on the Internet Images: https://bitcoin.org/bitcoin.pdf","path":"bitcoin","image":"http://i.imgur.com/UVgTCia.png","released":true,"date":"2015-03-20T17:48:04.000Z","tags":["bitcoin","virtual","p2p","peer-to-peer"]}