{"title":"Colorblinding","content":"Nowadays, accessibility is a frequent topic when technology is talked about. And this matter has always interested me, how technology can be used to make things better for all. Because according to Colour Blind Awareness , some of the types of color blindness affects approximately 1 in 12 men and 1 in 200 women in the world. So, I did a little research about how the websites are made to attend also a color vision impaired person and the different kinds of color blindness. Researching along, I've found some websites which allow us to upload a picture and see how they look like for a color vision impaired person, but not the website itself. So, It came up onto my mind \"What if we could apply filters on the website?!\". Fortunately, it's possible using SVG. The filters are made in SVG with the matrices of each filter corresponding to each color blindness, so the browser can multiply the values. The filters are applied to the website using CSS3 and jQuery. The matrices were calculated from here and SVG original file from here . After the researching, I started to make this Chrome Extension that displays in real time how your website can be seen by them, including images and videos. Colorblinding is working with the following types: Red-Blind / Protanopia Green-Blind / Deuteranopia Blue-Blind / Tritanopia Red-Weak / Protanomaly Green-Weak / Deuteranomaly Blue-Weak / Tritanomaly Monochromacy / Achromatopsia Blue Cone Monochromacy Note1: If the website already uses a filter in its css, the elements might change their original location when applying Colorblinding. To get them back, just select the option deactivate and refresh the page if it doesn't do it by itself. Note2: Colorblinding works in all tabs and the filter is applied when the tab is fully loaded . The latest release is always available on the Chrome Web Store Colorblinding . Those are examples how it looks like:","path":"colorblinding","image":"http://i.imgur.com/iK49vgq.png","released":true,"date":"2015-03-23T14:31:33.000Z","github":"https://github.com/LeonardoCardoso/Colorblinding","tags":["accessibility","chrome","extension"]}