{"title":"'Information Wants to Be Free'... But which kind of information?","content":"With the recent personal information leaks, the Stewart Brand's \"Information wants to be free\" resurfaces. But what kind of information is that?! This sentence is linked to another sentence \"Information wants to be expensive\" at the same statement. So it can be understood free referring to price and/or freedom. In fact, unfortunately, generalizing that \"Information wants to be free\" thing doesn't discriminate if this \"information\" is a music file, a part of a book text, or your personal data, credit cards and medical problems. Once information has passed to a new location outside of the source's control there is no way of ensuring it is not propagated further and widely distributed. Personal information must remain private (expensive, on other words), unless the owner wants it to be public. Government's information, such projects, expenditures, partnerships details, must be public because, in the end, the government is people's. And when it's not made public, it leaves an open gap to take advantage in whatever. Private companies' information must remain private. However, from the moment that companies information extend to the people and/or their government, they should be made public. A clear example of these is that news websites charge readers to view content on their pages, or offer some content for free and charge for them beyond the free area. But this type of general information should be public, as they are news that commonly are broadcasted in open television. Additionally, advertisements seems not to be enough for those websites, even more constant than in TV. And that information mostly involves public places or the people directly, such as protests coverage, public parties, etc. Unlike a fully streaming service that the only source of income is the monthly subscription (music, video or books services, for example). Such services need to pay royalties, production, licensing, etc. But even if the series are shared by torrents, it has a huge self-advertisement and much larger than in a paid service. Thus, it ends to cause the person to buy products, including books of which the series are based from. I can tell you that empirically. It is a call of the streaming services to offer better options for people tend to sign in on them. It's fair that they offer a free content and a paid content. But they can not forbid you to listen to their music, watch their series, read their books with the people in your circle. Digital content of common information should be free. In fact, I would say that not only does information want to be free but also the very content is often better when it is free. Not only to readers but also free to publishers. In most of social networks, they are rules about publishing contents. They might violate terms of use. Is it a censorship?! If you are using that service, you may accept their terms, including the removal of some content. This was publicly first contested by Internet pioneer John Gilmore in the pages of TIME Magazine in 1993: \"The Net interprets censorship as damage and routes around it.\". Back then, family-friendly online services used to delete messages they found offensive. Nowadays, those services even have features that the very users can report the content about that violation. And the Net really takes down content that does not fit to their subjective mind. Subjective because what can be offensive to me cannot be offensive to you. I know you probably heard about the Wikileaks-Amazon-Paypal thing. But, is any suppression of content a censorship?! Some things definitely need to be suppressed, removed, such as child pornography, don't you think?! As said by Jerry Brito, in Why Your Personal Information Wants to Be Free , it's better to think as information control rather censorship. We all think about information control somehow, that implies the subjectiveness I talked about. But what John Gilmore said about censorship applies to attempt to control any information online. Additionally, you need to keep in mind that you must be responsible for everything you do online at all circumstances. Because, everybody has access to it of a certain way. In fact, we can't control the information flood. Regarding the software, my thought is Open Source as many others think like me, probably most of us. However, we cannot force companies to open their code, although many companies use free-licensed softwares (or codes) in their background and don't mention them as the code license asks to. There is a mindset that needs to be accepted and received, not imposed. Of course there are things that must be kept secret even in a code like third-party credentials, for example. Despite the good sense, always there will be people trying to invade companies' system and companies trying the close those breaches. Like Stallman, \"I believe that all generally useful information should be free. By 'free' I am not referring to price, but rather to the freedom to copy the information and to adapt it to one's own uses... When information is generally useful, redistributing it makes humanity wealthier no matter who is distributing and no matter who is receiving.\" The Open Source thinking allows the society evolve technologically faster. Complementary readings Why Your Personal Information Wants to Be Free Privacy Matters The Definitive Story of Information Wants to Be Free Information wants to be free ... and expensive Information Wants To Be Free Entrepreneurs Must Defend Intellectual Property Rights","path":"information-wants-to-be-free-but-which-kind-of-information","image":"http://i.imgur.com/cwPQFSr.png","released":true,"date":"2015-03-03T05:56:36.000Z","tags":["information","activism"]}