[{"title":"InfiniteBlocks!","image":"http://i.imgur.com/KZnxPNp.png","tags":["iOS","games"],"content":"I'm going on an adventure!!! I always wanted to explore the world of making games. And this is my first game. It's a Tetris-like open-source game made in Swift and based in Swiftris . It's addicting!","date":"2015-08-14T00:19:37.000Z","path":"infiniteblocks"},{"title":"Swift Link Preview","image":"http://i.imgur.com/IVKMwTw.jpg","tags":["iOS","link-preview","swift"],"content":"I gotta confess that I got obsessed on trying to port my first Link Preview project to other platforms. I made it! First to Android , then a reboot using newer technologies and now it's on Swift! That's right! Swift is a great programming language that allows us to learn faster and build more stuff in less time because of its simplicity. Back then when I created my first project related to previewing link only Facebook used this feature on their services. Now many companies preview links inside their products. But none of them has open-sourced it. It basically does the same thing as the others. It makes a preview from an URL, grabbing all the information such as title, relevant texts and images. Requirements and Details iOS 8.0+ / macOS 10.9+ / tvOS 9.0+ / watchOS 2.0+ Xcode 7.3 or above Built with Swift 2.2.1 Installation CocoaPods To use SwiftLinkPreview as a pod package just add the following in your Podfile file. source 'https://github.com/CocoaPods/Specs.git' platform :ios, '8.0' target 'Your Project Name' do use_frameworks! // ... pod 'SwiftLinkPreview', '~ 0.1.4' // ... end Carthage To use SwiftLinkPreview as a Carthage module package just add the following in your Cartfile file. // ... github \"LeonardoCardoso/SwiftLinkPreview\" ~ 0.1.4 // ... Swift Package Manager To use SwiftLinkPreview as a Swift Package Manager package just add the following in your Package.swift file. import PackageDescription let package = Package( name: \"Your Target Name\", dependencies: [ .Package(url: \"https://github.com/LeonardoCardoso/SwiftLinkPreview.git\", majorVersion: 0) ] ) Manually You just need to drop SwiftLinkPreview folder into Xcode project (make sure to enable \"Copy items if needed\" and \"Create groups\"). Usage Instatiating import SwiftLinkPreview // ... let slp = SwiftLinkPreview() Requesting preview slp.preview( \"Text containing URL\", onSuccess: { result in print(\"\\(result)\") }, onError: { error in print(\"\\(error)\") } ) result is a dictionary [String: AnyObject] like: [ \"url\": \"original URL\", // NSURL \"finalUrl\": \"final ~unshortened~ URL.\", // NSURL \"canonicalUrl\": \"canonical URL\", // NSURL \"title\": \"title\", // String \"description\": \"page description or relevant text\", // String \"images\": [\"array of URLs of the images\"], // String array \"image\": \"main image\" // String ] Cancelling a request slp.cancel() Flow Important You need to set Allow Arbitrary Loads to YES on your project's Info.plist file. License The MIT License (MIT) Copyright (c) 2016 Leonardo Cardoso Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.","date":"2016-06-22T18:10:27.000Z","path":"swift-link-preview"},{"title":"Veetral","image":"http://i.imgur.com/ti4rgYl.png","tags":["iOS","camera"],"content":"Photo collage made easy 1. Choose your grid style: You tell how many pieces your veetral will have choosing between grids. 2. Select the pieces: Tap in the squares you want to snap first and hit the camera button. 3. Complete the photo: Do the same of the second step until the whole picture is done. 4. Share it as you like: Use your social medias or private messaging to your friends and family or just save it to your Camera Roll.","date":"2015-05-14T07:18:54.000Z","path":"veetral"}]