{"title":"Google honors George Boole","content":"Today's Google's doodle is about one great mathematician and one of the greatest contributors to build what we today call it a computer: George Boole. In fact, Modern Computing and Modern Electronics started to be built a long time after 'The Laws of Thinking' — Boole's main work —, like a century after. Would Boole think that his work would be so important?! So important that every little action ~even in binary nerdie stuff~ in computer obeys the Boolean Logic. That's right! It got his name on it! At least that... The boolean value is fundamental for programming languages. This boolean value will tell if something is true or false , so the computer can perform actions based on these commands. Additionally, there are some combinations with true and false which are very largely used, which the Google's Doodle is representing. First take a look and the second G on the doodle, it represents x and y ~ our variables ~, and when the variable is showing its value is true , otherwise is false , let's go to the combinations: AND: for a 'AND' to produce a true value, both variables must be true. In our case, x and y must be true so the first G will be colored, otherwise 'AND' will produce a false value. XOR: for a 'XOR' to produce a true value, only one of the variables must be true. In our case, x must be true or y must be true, not both, so the first O will be colored, otherwise 'XOR' will produce a false value. X stands for exclusive. OR: for an 'OR' to produce a true value, at least one of the variables must be true. In our case, x or y must be true, or both, so the second O will be colored, otherwise 'OR' will produce a false value. NOT: differently of 'AND', 'OR' and 'XOR' that are binary, 'NOT' is an unary operation. For a 'NOT' to produce a true value, the variable must be false, because it's negating the its value. If the variable is true, 'NOT' will produce a false value. In our case, y must be false so the L will be colored, and x must be false so the E will be colored. Here we used only two variables, but those operations can be use with as much as variables you want, like: x AND y AND z AND a... So, because of this important contribution, Google honors the 200 th George Boole's birthday. Well done, Google!","path":"google-honors-george-boole","image":"http://i.imgur.com/Jkof57C.gif","released":true,"date":"2015-11-02T16:03:52.000Z","tags":["googe","doodle","boole","boolean"]}